results/2026-07-09_v8_tuning/lfm2.5-8b-a1b/chunk2048_cap32/toolagent/bench.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31220, dataset_name='mooncake', dataset_path='', model='/data/hf/LFM2.5-8B-A1B', served_model_name=None, tokenizer=None, num_prompts=2000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=128, output_file='/home/t-jialianggu/work/EndtoEnd-auto-optimization/results/2026-07-09_v8_tuning/lfm2.5-8b-a1b/chunk2048_cap32/toolagent/bench_serving_result.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=0.1, mooncake_num_rounds=1, mooncake_workload='toolagent', tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31220, dataset_name='mooncake', dataset_path='', model='/data/hf/LFM2.5-8B-A1B', served_model_name=None, tokenizer=None, num_prompts=2000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=128, output_file='/home/t-jialianggu/work/EndtoEnd-auto-optimization/results/2026-07-09_v8_tuning/lfm2.5-8b-a1b/chunk2048_cap32/toolagent/bench_serving_result.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=0.1, mooncake_num_rounds=1, mooncake_workload='toolagent', tag=None, header=None)

Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
Using time-based Mooncake request scheduler, ignoring --request-rate.
Starting Mooncake trace replay. Sessions: 2000, Rounds per session: 1. Slowdown factor: 0.1
100%|██████████| 2000/2000 [02:13<00:00, 15.03it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 128       
Successful requests:                     2000      
Benchmark duration (s):                  133.10    
Total input tokens:                      4998220   
Total input text tokens:                 4998220   
Total generated tokens:                  371759    
Total generated tokens (retokenized):    371759    
Request throughput (req/s):              15.03     
Input token throughput (tok/s):          37553.76  
Output token throughput (tok/s):         2793.18   
Peak output token throughput (tok/s):    5302.00   
Peak concurrent requests:                159       
Total token throughput (tok/s):          40346.94  
Concurrency:                             121.02    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   8053.65   
Median E2E Latency (ms):                 745.67    
P90 E2E Latency (ms):                    21000.25  
P99 E2E Latency (ms):                    24896.94  
---------------Time to First Token----------------
Mean TTFT (ms):                          6009.35   
Median TTFT (ms):                        198.73    
P99 TTFT (ms):                           17922.42  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          12.77     
Median TPOT (ms):                        10.56     
P99 TPOT (ms):                           59.02     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           11.06     
Median ITL (ms):                         4.85      
P95 ITL (ms):                            34.01     
P99 ITL (ms):                            100.97    
Max ITL (ms):                            732.63    
==================================================